analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/spixfm_regs.h
/**@} end of group SPIXFM_CTRL_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_FETCHCTRL SPIXFM_FETCHCTRL
 * @brief    SPIX Fetch Control Register.
 * @{
 */
#define MXC_F_SPIXFM_FETCHCTRL_CMD_VAL_POS             0 /**< FETCHCTRL_CMD_VAL Position */
#define MXC_F_SPIXFM_FETCHCTRL_CMD_VAL                 ((uint32_t)(0xFFUL << MXC_F_SPIXFM_FETCHCTRL_CMD_VAL_POS)) /**< FETCHCTRL_CMD_VAL Mask */

#define MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS            8 /**< FETCHCTRL_CMD_WDTH Position */
#define MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH                ((uint32_t)(0x3UL << MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS)) /**< FETCHCTRL_CMD_WDTH Mask */
#define MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_SINGLE         ((uint32_t)0x0UL) /**< FETCHCTRL_CMD_WDTH_SINGLE Value */
#define MXC_S_SPIXFM_FETCHCTRL_CMD_WDTH_SINGLE         (MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_SINGLE << MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS) /**< FETCHCTRL_CMD_WDTH_SINGLE Setting */
#define MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_DUAL_IO        ((uint32_t)0x1UL) /**< FETCHCTRL_CMD_WDTH_DUAL_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_CMD_WDTH_DUAL_IO        (MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_DUAL_IO << MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS) /**< FETCHCTRL_CMD_WDTH_DUAL_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_QUAD_IO        ((uint32_t)0x2UL) /**< FETCHCTRL_CMD_WDTH_QUAD_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_CMD_WDTH_QUAD_IO        (MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_QUAD_IO << MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS) /**< FETCHCTRL_CMD_WDTH_QUAD_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_INVALID        ((uint32_t)0x3UL) /**< FETCHCTRL_CMD_WDTH_INVALID Value */
#define MXC_S_SPIXFM_FETCHCTRL_CMD_WDTH_INVALID        (MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_INVALID << MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS) /**< FETCHCTRL_CMD_WDTH_INVALID Setting */

#define MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS           10 /**< FETCHCTRL_ADDR_WDTH Position */
#define MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH               ((uint32_t)(0x3UL << MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS)) /**< FETCHCTRL_ADDR_WDTH Mask */
#define MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_SINGLE        ((uint32_t)0x0UL) /**< FETCHCTRL_ADDR_WDTH_SINGLE Value */
#define MXC_S_SPIXFM_FETCHCTRL_ADDR_WDTH_SINGLE        (MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_SINGLE << MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS) /**< FETCHCTRL_ADDR_WDTH_SINGLE Setting */
#define MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_DUAL_IO       ((uint32_t)0x1UL) /**< FETCHCTRL_ADDR_WDTH_DUAL_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_ADDR_WDTH_DUAL_IO       (MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_DUAL_IO << MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS) /**< FETCHCTRL_ADDR_WDTH_DUAL_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_QUAD_IO       ((uint32_t)0x2UL) /**< FETCHCTRL_ADDR_WDTH_QUAD_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_ADDR_WDTH_QUAD_IO       (MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_QUAD_IO << MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS) /**< FETCHCTRL_ADDR_WDTH_QUAD_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_INVALID       ((uint32_t)0x3UL) /**< FETCHCTRL_ADDR_WDTH_INVALID Value */
#define MXC_S_SPIXFM_FETCHCTRL_ADDR_WDTH_INVALID       (MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_INVALID << MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS) /**< FETCHCTRL_ADDR_WDTH_INVALID Setting */

#define MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS           12 /**< FETCHCTRL_DATA_WDTH Position */
#define MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH               ((uint32_t)(0x3UL << MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS)) /**< FETCHCTRL_DATA_WDTH Mask */
#define MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_SINGLE        ((uint32_t)0x0UL) /**< FETCHCTRL_DATA_WDTH_SINGLE Value */
#define MXC_S_SPIXFM_FETCHCTRL_DATA_WDTH_SINGLE        (MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_SINGLE << MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS) /**< FETCHCTRL_DATA_WDTH_SINGLE Setting */
#define MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_DUAL_IO       ((uint32_t)0x1UL) /**< FETCHCTRL_DATA_WDTH_DUAL_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_DATA_WDTH_DUAL_IO       (MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_DUAL_IO << MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS) /**< FETCHCTRL_DATA_WDTH_DUAL_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_QUAD_IO       ((uint32_t)0x2UL) /**< FETCHCTRL_DATA_WDTH_QUAD_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_DATA_WDTH_QUAD_IO       (MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_QUAD_IO << MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS) /**< FETCHCTRL_DATA_WDTH_QUAD_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_INVALID       ((uint32_t)0x3UL) /**< FETCHCTRL_DATA_WDTH_INVALID Value */
#define MXC_S_SPIXFM_FETCHCTRL_DATA_WDTH_INVALID       (MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_INVALID << MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS) /**< FETCHCTRL_DATA_WDTH_INVALID Setting */

#define MXC_F_SPIXFM_FETCHCTRL_4BADDR_POS              16 /**< FETCHCTRL_4BADDR Position */
#define MXC_F_SPIXFM_FETCHCTRL_4BADDR                  ((uint32_t)(0x1UL << MXC_F_SPIXFM_FETCHCTRL_4BADDR_POS)) /**< FETCHCTRL_4BADDR Mask */

/**@} end of group SPIXFM_FETCHCTRL_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_MODECTRL SPIXFM_MODECTRL
 * @brief    SPIX Mode Control Register.
 * @{
 */
#define MXC_F_SPIXFM_MODECTRL_MDCLK_POS                0 /**< MODECTRL_MDCLK Position */
#define MXC_F_SPIXFM_MODECTRL_MDCLK                    ((uint32_t)(0xFUL << MXC_F_SPIXFM_MODECTRL_MDCLK_POS)) /**< MODECTRL_MDCLK Mask */

#define MXC_F_SPIXFM_MODECTRL_NOCMD_POS                8 /**< MODECTRL_NOCMD Position */
#define MXC_F_SPIXFM_MODECTRL_NOCMD                    ((uint32_t)(0x1UL << MXC_F_SPIXFM_MODECTRL_NOCMD_POS)) /**< MODECTRL_NOCMD Mask */

#define MXC_F_SPIXFM_MODECTRL_EXIT_NOCMD_POS           9 /**< MODECTRL_EXIT_NOCMD Position */
#define MXC_F_SPIXFM_MODECTRL_EXIT_NOCMD               ((uint32_t)(0x1UL << MXC_F_SPIXFM_MODECTRL_EXIT_NOCMD_POS)) /**< MODECTRL_EXIT_NOCMD Mask */

/**@} end of group SPIXFM_MODECTRL_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_MODEDATA SPIXFM_MODEDATA
 * @brief    SPIX Mode Data Register.
 * @{
 */
#define MXC_F_SPIXFM_MODEDATA_DATA_POS                 0 /**< MODEDATA_DATA Position */
#define MXC_F_SPIXFM_MODEDATA_DATA                     ((uint32_t)(0xFFFFUL << MXC_F_SPIXFM_MODEDATA_DATA_POS)) /**< MODEDATA_DATA Mask */

#define MXC_F_SPIXFM_MODEDATA_OUT_EN_POS               16 /**< MODEDATA_OUT_EN Position */
#define MXC_F_SPIXFM_MODEDATA_OUT_EN                   ((uint32_t)(0xFFFFUL << MXC_F_SPIXFM_MODEDATA_OUT_EN_POS)) /**< MODEDATA_OUT_EN Mask */

/**@} end of group SPIXFM_MODEDATA_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_FBCTRL SPIXFM_FBCTRL
 * @brief    SPIX Feedback Control Register.
 * @{
 */
#define MXC_F_SPIXFM_FBCTRL_EN_POS                     0 /**< FBCTRL_EN Position */
#define MXC_F_SPIXFM_FBCTRL_EN                         ((uint32_t)(0x1UL << MXC_F_SPIXFM_FBCTRL_EN_POS)) /**< FBCTRL_EN Mask */

#define MXC_F_SPIXFM_FBCTRL_INVERT_POS                 1 /**< FBCTRL_INVERT Position */
#define MXC_F_SPIXFM_FBCTRL_INVERT                     ((uint32_t)(0x1UL << MXC_F_SPIXFM_FBCTRL_INVERT_POS)) /**< FBCTRL_INVERT Mask */

/**@} end of group SPIXFM_FBCTRL_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_IOCTRL SPIXFM_IOCTRL
 * @brief    SPIX IO Control Register.
 * @{
 */
#define MXC_F_SPIXFM_IOCTRL_SCLK_DS_POS                0 /**< IOCTRL_SCLK_DS Position */
#define MXC_F_SPIXFM_IOCTRL_SCLK_DS                    ((uint32_t)(0x1UL << MXC_F_SPIXFM_IOCTRL_SCLK_DS_POS)) /**< IOCTRL_SCLK_DS Mask */

#define MXC_F_SPIXFM_IOCTRL_SS_DS_POS                  1 /**< IOCTRL_SS_DS Position */
#define MXC_F_SPIXFM_IOCTRL_SS_DS                      ((uint32_t)(0x1UL << MXC_F_SPIXFM_IOCTRL_SS_DS_POS)) /**< IOCTRL_SS_DS Mask */

